'================================Git====================================='
#Git- это распределенная система контроля версии. Система для отслеживания и введения истории изменения файлов в нашем проекте. При помощи Git можно организовать командную работу
#  Репозиторий - это хранилтище нашего кода и истории его изменений
#  Gidhub - это вебсайт для размещения git - репозиториев для совместной оазработке проектов

'''
 git add . - добавить все файлы в индекс 
 git commit -m 'comment' - зафиксировать изменения
'''
